Revit 2024 API
DisplacementElement.ResetDisplacedElements Method
 Sets the translation of the DisplacementElement to (0, 0, 0). The DisplacementElement continues to exist, but its elements are displayed in their actual location.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public void ResetDisplacedElements()
Visual Basic
Public Sub ResetDisplacedElements
Visual C++
public:
void ResetDisplacedElements()
See Also
DisplacementElement Class
Autodesk.Revit.DB Namespace